In [1]:
import pandas as pd 
print(pd.__version__)

2.2.2

In [2]:
data = {'col1':['1', '2', '3', 'teks'],
        'cols2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 cols2
0     1     1
1     2     2
2     3     3
3  teks     4

In [3]:
df.dtypes

col1     object
cols2    object
dtype: object

In [4]:
df_x = df.astype({'cols2':'int'})
df_x

   col1  cols2
0     1      1
1     2      2
2     3      3
3  teks      4

In [5]:
df_x.dtypes

col1     object
cols2     int32
dtype: object

In [6]:
df_x = df.astype({'cols2':'float'})
df_x

   col1  cols2
0     1    1.0
1     2    2.0
2     3    3.0
3  teks    4.0

In [7]:
df.apply(pd.to_numeric, errors='coerce')

   col1  cols2
0   1.0      1
1   2.0      2
2   3.0      3
3   NaN      4